#### Terraform Plan 📖`success`
#### `Plan: 11 to add, 15 to change, 7 to destroy.`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Stromweld/tf_repo_manager/runs/run-99CiXs354BFihv4k

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_repository.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_repository.this: Refreshing state... [id=terraform-tfe-workspaces]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_repository.this: Refreshing state... [id=tf_repo_manager]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_repository.this: Refreshing state... [id=terraform-github-repositories]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_repository.this: Refreshing state... [id=terraform-tfe-private-modules]
module.other_repos.module.looper["chef-repo"].module.repository.github_repository.this: Refreshing state... [id=chef-repo]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_autopatch_ii]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_repository.this: Refreshing state... [id=chef_chef_software]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository.this: Refreshing state... [id=chef_timezone_iii]
module.other_repos.module.looper["github-workflows"].module.repository.github_repository.this: Refreshing state... [id=github-workflows]
module.other_repos.module.looper["kickstart"].module.repository.github_repository.this: Refreshing state... [id=kickstart]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_collectd_ii]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_repository.this: Refreshing state... [id=aws_temp_saml_creds]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_repository.this: Refreshing state... [id=chef_base_config]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_artifactory_ii]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_repository.this: Refreshing state... [id=chef_base_role]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_actions_secret.this["TOKEN_TFC"]: Refreshing state... [id=terraform-tfe-workspaces:TOKEN_TFC]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_actions_secret.this["TOKEN_TFC"]: Refreshing state... [id=terraform-tfe-private-modules:TOKEN_TFC]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_actions_secret.this["TOKEN_TFC"]: Refreshing state... [id=terraform-github-repositories:TOKEN_TFC]
tfe_oauth_client.github: Refreshing state... [id=oc-My3Z8GgnzemkfQKc]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHSeHTM4Bh7gF]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_branch_default.this: Refreshing state... [id=tf_repo_manager]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwQ84BiWy1]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-tfe-workspaces]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwT84BiWy3]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwe84BiWy6]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-tfe-private-modules]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-github-repositories]
module.other_repos.module.looper["kickstart"].module.repository.github_branch_default.this: Refreshing state... [id=kickstart]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOBP18Nc4Bh7f_]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch_default.this: Refreshing state... [id=chef-repo]
module.other_repos.module.looper["github-workflows"].module.repository.github_branch_default.this: Refreshing state... [id=github-workflows]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOFQgqW84Bh7gA]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_default.this: Refreshing state... [id=aws_temp_saml_creds]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCbdKjM4Bh7f-]
module.other_repos.module.looper["github-workflows"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwbc4BiWy2]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_default.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk]
module.other_repos.module.looper["kickstart"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCW9ReM4Bh7gC]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-bjcjq8rHd2mYxoSq]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-cePnVEzzY2MwYRNw]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-mHz65UZ77CqY4nFa]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.tf_workspace["default"].tfe_workspace.workspace: Refreshing state... [id=ws-sKUnXifAZaTLrKVo]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository_collaborator.this["limitusus"]: Refreshing state... [id=chef_timezone_iii:limitusus]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_timezone_iii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_artifactory_ii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_autopatch_ii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_base_config:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_base_role:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_chef_software:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_collectd_ii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_autopatch_ii:main]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_chef_software:main]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_timezone_iii]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_artifactory_ii]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_branch_default.this: Refreshing state... [id=chef_base_role]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_default.this: Refreshing state... [id=chef_chef_software]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzU5Mzgw]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_branch_default.this: Refreshing state... [id=chef_base_config]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_autopatch_ii]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCbOQcM4Bh7gD]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHXVheM4BioLf]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHXVhc84BioLg]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_collectd_ii]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE1]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE3]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY0NzAy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_artifactory_ii"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] must be replaced
-/+ resource "github_actions_secret" "this" {
      ~ created_at      = "2022-06-23 20:03:52 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "chef_artifactory_ii:SUPERMARKET_KEY" -> (known after apply)
      - plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-06-23 20:03:52 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "chef_artifactory_ii"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "chef_artifactory_ii"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (30 unchanged attributes hidden)
    }

  # module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_automate_ha"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_automate_ha"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "chef_automate_ha"
    }

  # module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_branch_protection.default["main"] will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Development repository for the automate_ha Chef Cookbook"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "ChefCookbook"
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "apache-2.0"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "chef_automate_ha"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
    }

  # module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] must be replaced
-/+ resource "github_actions_secret" "this" {
      ~ created_at      = "2022-06-23 20:03:50 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "chef_autopatch_ii:SUPERMARKET_KEY" -> (known after apply)
      - plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-06-23 20:03:50 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.chef_cb_repos.module.looper["chef_base_config"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_base_config"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] must be replaced
-/+ resource "github_actions_secret" "this" {
      ~ created_at      = "2022-06-23 20:03:53 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "chef_base_config:SUPERMARKET_KEY" -> (known after apply)
      - plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-06-23 20:03:53 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "chef_base_config"
        name                        = "chef_base_config"
      ~ visibility                  = "public" -> "private"
        # (34 unchanged attributes hidden)
    }

  # module.chef_cb_repos.module.looper["chef_base_role"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_base_role"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] must be replaced
-/+ resource "github_actions_secret" "this" {
      ~ created_at      = "2022-06-23 20:03:51 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "chef_base_role:SUPERMARKET_KEY" -> (known after apply)
      - plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-06-23 20:03:51 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "chef_base_role"
        name                        = "chef_base_role"
      ~ visibility                  = "public" -> "private"
        # (34 unchanged attributes hidden)
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] must be replaced
-/+ resource "github_actions_secret" "this" {
      ~ created_at      = "2022-06-23 20:03:56 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "chef_chef_software:SUPERMARKET_KEY" -> (known after apply)
      - plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-06-23 20:03:56 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_collectd_ii"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] must be replaced
-/+ resource "github_actions_secret" "this" {
      ~ created_at      = "2022-06-23 20:03:54 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "chef_collectd_ii:SUPERMARKET_KEY" -> (known after apply)
      - plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-06-23 20:03:54 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "chef_collectd_ii"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "chef_collectd_ii"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (30 unchanged attributes hidden)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_timezone_iii"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] must be replaced
-/+ resource "github_actions_secret" "this" {
      ~ created_at      = "2022-06-23 20:03:47 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "chef_timezone_iii:SUPERMARKET_KEY" -> (known after apply)
      - plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-06-23 20:03:47 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ archived                    = false -> true
        id                          = "chef_timezone_iii"
        name                        = "chef_timezone_iii"
        # (34 unchanged attributes hidden)
    }

  # module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "Chef_AD_DNS_Solarwinds_Spacewalk"
      + sha        = (known after apply)
    }

  # module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "Chef_AD_DNS_Solarwinds_Spacewalk"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "Chef_AD_DNS_Solarwinds_Spacewalk"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (28 unchanged attributes hidden)
    }

  # module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "aws_temp_saml_creds"
      + sha        = (known after apply)
    }

  # module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "aws_temp_saml_creds"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "aws_temp_saml_creds"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (29 unchanged attributes hidden)
    }

  # module.other_repos.module.looper["chef-repo"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef-repo"
      + sha        = (known after apply)
    }

  # module.other_repos.module.looper["chef-repo"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "chef-repo"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "chef-repo"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (29 unchanged attributes hidden)
    }

  # module.other_repos.module.looper["github-workflows"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "github-workflows"
      + sha        = (known after apply)
    }

  # module.other_repos.module.looper["github-workflows"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "github-workflows"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "github-workflows"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (29 unchanged attributes hidden)
    }

  # module.other_repos.module.looper["kickstart"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "kickstart"
      + sha        = (known after apply)
    }

  # module.other_repos.module.looper["kickstart"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "kickstart"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "kickstart"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (29 unchanged attributes hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "terraform-github-repositories"
      + sha        = (known after apply)
    }

  # module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "terraform-github-repositories"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-github-repositories"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (30 unchanged attributes hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "terraform-tfe-private-modules"
      + sha        = (known after apply)
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "terraform-tfe-private-modules"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-tfe-private-modules"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (30 unchanged attributes hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "terraform-tfe-workspaces"
      + sha        = (known after apply)
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "terraform-tfe-workspaces"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-tfe-workspaces"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (30 unchanged attributes hidden)
    }

  # module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "tf_repo_manager"
      + sha        = (known after apply)
    }

  # module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "tf_repo_manager"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "tf_repo_manager"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (29 unchanged attributes hidden)
    }

  # module.tf_repo_manager.module.looper["tf_repo_manager"].module.tf_workspace["default"].tfe_workspace.workspace will be updated in-place
  ~ resource "tfe_workspace" "workspace" {
      + force_delete                  = false
        id                            = "ws-sKUnXifAZaTLrKVo"
        name                          = "tf_repo_manager"
      ~ terraform_version             = "1.2.3" -> "1.3.5"
        # (16 unchanged attributes hidden)
    }

Plan: 11 to add, 15 to change, 7 to destroy.


```

</details>

*Pushed by: @Stromweld, Action: `pull_request`*